app/controllers/employees_controller.rb

INSERT INTO "employees" ("name", "email", "created_at", "updated_at", "empid", "location", "surname", "dob", "fathername", "mothername", "address", "infosyspass", "infosysfoodcourtpass", "dlfpass", "policeverificationstartdate", "policeverificationenddate", "policeverificationreminderdate", "medical", "medicalexpirydate", "medicalreminderdate", "arrivaldate", "photo", "grandfathername", "age", "pan", "responsibility", "comments", "education") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28) RETURNING "id"
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "name" = $1, "email" = $2, "surname" = $3, "dob" = $4, "address" = $5, "policeverificationstartdate" = $6, "policeverificationenddate" = $7, "policeverificationreminderdate" = $8, "medical" = $9, "medicalexpirydate" = $10, "medicalreminderdate" = $11, "arrivaldate" = $12, "updated_at" = $13 WHERE "employees"."id" = $14
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)